Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Returns the state whether the specified window is maximized or minimized.
ja: 指定されたウィンドウが最大化されているか最小化されているかの状態を返します。

source: Returns the status of the drive which contains the specified path.
ja: 指定されたパスが含まれるドライブの状態を返します。

source: Returns the string (usually a single character) corresponding to the character code indicated by the specified number.
ja: 指定された番号で示される文字コードに対応する文字列（通常は1文字）を返す。

source: Returns the style or extended style (respectively) of the specified window.
ja: 指定されたウィンドウのスタイルまたは拡張スタイル（それぞれ）を返します。

source: Returns the target object (Obj).
ja: 対象オブジェクト（Obj）を返します。

source: Returns the text of the specified line in an Edit control.
ja: Edit コントロールの指定された行のテキストを返します。

source: Returns the total capacity of the drive which contains the specified path, in megabytes.
ja: 指定されたパスを含むドライブの総容量をメガバイト単位で返します。

source: Returns the total number of items in the control.
ja: コントロール内の項目の総数を返します。

source: Returns the total number of monitors.
ja: モニターの総数を返します。

source: Returns the total number of rows or columns.
ja: 行または列の合計数を返します。

source: Returns the trigonometric cosine of a number.
ja: Cosine関数は、数値の三角コサインを返します。

source: Returns the trigonometric cosine of the specified number.
ja: 指定された数値の三角余弦を返します。

source: Returns the trigonometric sine of a number.
ja: TrionometricSine関数は、数値の正弦を返します。

source: Returns the trigonometric sine of the specified number.
ja: 指定された数値の三角波の正弦を返します。

source: Returns the trigonometric tangent of a number.
ja: TrionometricTangent関数は、数値の三角形の正接を返します。

source: Returns the trigonometric tangent of the specified number.
ja: 指定された数値の三角形の正接を返します。

source: Returns the type of the drive which contains the specified path.
ja: 指定されたパスを含むドライブの種類を返します。

source: Returns the type of the specified drive's file system.
ja: 指定されたドライブのファイルシステムの種類を返します。

source: Returns the unique ID number (HWND) of the last/bottommost window if there is more than one match.
ja: 一致するウィンドウが複数ある場合に、最後または一番下のウィンドウのウィンドウハンドル（HWND）を返します。

source: Returns the unique ID number (HWND) of the specified window.
ja: 指定されたウィンドウのID（HWND）を返します。

source: Returns the unique ID number of the last/bottommost window if there is more than one match.
ja: 一致するウィンドウが複数ある場合、最後/最下段のウィンドウの固有ID番号を返します。

source: Returns the unique ID number of the specified control.
ja: 指定されたコントロールのユニークな ID 番号を返します。

source: Returns the unique ID number of the specified window.
ja: 指定されたウィンドウのユニークなID番号を返します。

source: Returns the unique ID numbers for all controls in the specified window.
ja: 指定されたウィンドウ内のすべてのコントロールの固有のID番号を返します。

source: Returns the unique ID numbers of all existing windows that match the specified criteria.
ja: 指定された条件に合致するすべての既存ウィンドウの固有ID番号を返します。

source: Returns the upper bound of the nth dimension.
ja: n次元の上限値を返す。

source: Returns the value associated with a key, or a default value.
ja: キーに関連する値、またはデフォルト値を返します。

source: Returns the value at a given index, or a default value.
ja: 指定されたインデックスにある値、またはデフォルト値を返します。

source: Returns the value's base object.
ja: 値のベースとなるオブジェクトを返します。

source: Returns the volume label of the specified drive.
ja: 指定されたドライブのボリュームラベルを返します。

source: Returns the volume serial number of the specified drive.
ja: 指定されたドライブのボリュームシリアルナンバーを返します。

source: Returns true if BaseObj is in Value's chain of base objects, otherwise false.
ja: BaseObjが Valueのベースオブジェクトの連鎖の中にある場合はtrueを、そうでない場合はfalseを返します。

source: Returns true if BaseObj is in Value's chain of base objects.
ja: BaseObjが Valueのベースオブジェクトの連鎖の中にある場合、trueを返す。

source: Returns true if an object owns a property by the specified name, otherwise false.
ja: オブジェクトが指定された名前のプロパティを所有している場合は真を、そうでない場合は偽を返します。

source: Returns true if an object owns a property by the specified name.
ja: オブジェクトが指定された名前のプロパティを所有している場合、true を返します。

source: Returns true if the Input is in progress and false otherwise.
ja: 入力中の場合はtrueを、それ以外の場合はfalseを返します。

source: Returns true if the specified index is valid and there is a value at that position, otherwise false.
ja: 指定されたインデックスが有効で、その位置に値がある場合は真を、そうでない場合は偽を返します。

source: Returns true if the specified index is valid and there is a value at that position.
ja: 指定されたインデックスが有効で、その位置に値がある場合に真を返します。

source: Returns true if the specified key has an associated value within a map, otherwise false.
ja: 指定されたキーがマップ内に関連する値を持つ場合はtrueを、そうでない場合はfalseを返します。

source: Returns true if the specified key has an associated value within a map.
ja: 指定されたキーがマップ内に関連する値を持つ場合、true を返す。

source: Returns true if the value has a method by this name, otherwise false.
ja: 値がこの名前のメソッドを持っている場合はtrueを、そうでない場合はfalseを返します。

source: Returns true if the value has a method by this name.
ja: 値がこの名前のメソッドを持つ場合、trueを返す。

source: Returns true if the value has a property by this name, otherwise false.
ja: 値がこの名前のプロパティを持つ場合はtrueを、そうでない場合はfalseを返します。

source: Returns true if the value has a property by this name.
ja: 値がこの名前のプロパティを持つ場合、trueを返す。

source: Returns true if the variable has been assigned a value (even if that value is an empty string), otherwise false.
ja: 変数に値が割り当てられている場合（その値が空文字列であっても）trueを、そうでない場合falseを返します。

source: Reusable code saves time, by avoiding the need to write and test code for the same or similar tasks over and over.
ja: 再利用可能なコードは、同じまたは類似のタスクのコードを何度も書いたりテストしたりする必要がないため、時間を節約することができます。

source: Reverse.
ja: 逆です。

source: Rewind 5 seconds
ja: 5秒巻き戻し

source: Right Alt (or AltGr, depending on keyboard layout)
ja: 右Alt（キーボードレイアウトによってはAltGr）

source: Right Alt.
ja: 右 Alt。

source: Right Ctrl
ja: 右Ctrl

source: Right Ctrl.
ja: 右Ctrl。

source: Right Shift
ja: 右Shift

source: Right Shift.
ja: 右Shift。

source: Right Win
ja: 右Win

source: Right Win.
ja: 右Win。

source: Right click inside the window, and click "Paste Shortcut".
ja: ウィンドウ内で右クリックし、「ショートカットの貼り付け」をクリックします。

source: Right click the blank window and select 'Edit message filter'.
ja: 空白のウィンドウを右クリックし、「Edit message filter」を選択する。

source: Right click the selected window in the list on left and select 'Messages'.
ja: 左側のリストで選択したウィンドウを右クリックし、「メッセージ」を選択します。

source: Right-Click on your desktop.
ja: デスクトップ上で右クリックします。

source: Right-aligns text in a multiline edit control.
ja: 複数行編集コントロールのテキストを右揃えにする。

source: Right-aligns the column's text.
ja: カラムのテキストを右寄せにします。

source: Right-aligns the text.
ja: テキストを右揃えにする。

source: Right-click the script in Explorer and select Run with UI access.
ja: エクスプローラでスクリプトを右クリックし、「UIアクセスで実行」を選択します。

source: Right-click the tray icon to show the tray menu, which has the following options by default:
ja: トレイアイコンを右クリックするとトレイメニューが表示され、デフォルトでは以下のオプションがあります：

source: Right-clicking on a template in the list gives the following options:
ja: リスト内のテンプレートを右クリックすると、以下のオプションが表示されます：

source: Right-justifies the control's text within its available width.
ja: コントロールのテキストを使用可能な幅の範囲内で右寄せにします。

source: Right-to-left reading order for Hebrew/Arabic
ja: ヘブライ語/アラビア語の右から左への読み方

source: Root key and subkey are combined.
ja: ルートキーとサブキーが結合されます。

source: Row methods:
ja: 列の方法：

source: RowNumber := 0 ; This causes the first iteration to start the search at the top.
ja: RowNumber := 0 ; これにより、最初の反復は先頭から検索を開始することになる。

source: RowNumber := LV.GetNext(RowNumber) ; Resume the search at the row after that found by the previous iteration.
ja: RowNumber := LV.GetNext(RowNumber) ; 前の反復で見つかった行の次の行から検索を再開する。

source: Rows are sorted in ascending order based on the contents of the first field.
ja: 行は、最初のフィールドの内容に基づいて昇順にソートされる。

source: Rows of height (upon creation).
ja: 高さの列（作成時）。

source: Rows of tabs will not be stretched to fill the entire width of the control.
ja: タブの行は、コントロールの幅いっぱいに引き伸ばされることはありません。

source: Rows of text (can contain a floating point number such as R2.5).
ja: テキストの行（R2.5のような浮動小数点数を含むことができます）。

source: Rules of quoted strings
ja: 引用符で囲まれた文字列のルール

source: Run "::{20D04FE0-3AEA-1069-A2D8-08002B30309D}" ; This PC (formerly My Computer or Computer).
ja: Run "::{20D04FE0-3AEA-1069-A2D8-08002B30309D}" ; PC（従来のマイコンピュータまたはコンピュータ）

source: Run "::{645FF040-5081-101B-9F08-00AA002F954E}" ; Recycle Bin.
ja: Run "::{645FF040-5081-101B-9F08-00AA002F954E}" ; ごみ箱

source: Run "Notepad" ; This is a comment on the same line as a function call.
ja: Run "Notepad" ; これは、関数呼び出しと同じ行にあるコメントです。

source: Run "cmd", "C:\" ; Open a command prompt at C:\
ja: Run "cmd", "C:\" ; コマンドプロンプトをC:\ に開きます。

source: Run "notepad" ; Open a new Notepad window
ja: Run "notepad" ; メモ帳の新規ウィンドウを開く

source: Run 'edit ' A_ScriptFullPath ; Generally equivalent to Edit
ja: Run 'edit ' A_ScriptFullPath ; 一般的にEditに相当します。

source: Run / RunWait - Syntax & Usage | AutoHotkey v2
ja: Run / RunWait - 構文と使用法｜AutoHotkey v2

source: Run Install.cmd.
ja: Install.cmdを実行します。

source: Run A_ComSpec ; Start a command prompt (almost always cmd.exe).
ja: Run A_ComSpec ; コマンドプロンプト（ほとんどの場合cmd.exe）を起動します。

source: Run A_ComSpec,,, &PID ; Run command prompt.
ja: Run A_ComSpec,,, &PID ; コマンドプロンプトを実行します。

source: Run A_MyDocuments ; Open the user's Documents folder.
ja: Run A_MyDocuments ; ユーザーのDocumentsフォルダを開く。

source: Run Dash instead of showing the old Welcome page in the documentation, when run without parameters.
ja: パラメータなしで実行した場合、ドキュメントの古いウェルカムページを表示する代わりにDashを実行します。

source: Run FTPLogFile ; Display the log for review.
ja: Run FTPLogFile ; ログを表示させて確認します。

source: Run a Script
ja: スクリプトの実行

source: Run and RunWait interpret Target differently
ja: RunとRunWaitでTargetの解釈は異なる

source: Run as Administrator
ja: 管理者として実行

source: Run as administrator
ja: 管理者として実行する

source: Run is able to launch CLSIDs:
ja: RunはCLSIDを起動することができます：

source: Run is able to launch URLs:
ja: Runは、URLの起動が可能です：

source: Run is able to launch Windows system programs from any directory.
ja: Runは、任意のディレクトリからWindowsシステムのプログラムを起動することができます。

source: Run script
ja: スクリプトを実行する

source: Run the CHM file as administrator or create the config file manually.
ja: CHMファイルを管理者として実行するか、手動で構成ファイルを作成します。

source: Run the script as administrator.
ja: スクリプトを管理者権限で実行します。

source: Run this and click Install.
ja: 実行してインストールをクリックします。

source: Run this code and see what you can learn from the result.
ja: このコードを実行し、その結果から何を学ぶことができるかを確認します。

source: Run this code to see your AHK version:
ja: このコードを実行すると、AHKのバージョンが表示されます：

source: Run this file to begin installing AutoHotkey.
ja: このファイルを実行すると、AutoHotkeyのインストールが始まります。

source: Run with UI Access
ja: UIアクセスで実行

source: Run with UI access (if the prerequisites are met)
ja: UIアクセスで実行する（前提条件を満たしている場合）

source: Run's OutputVarPID parameter returns the PID of the launcher.
ja: RunのOutputVarPIDパラメータは、ランチャーのPIDを返す。

source: Run's Parameters
ja: 実行時パラメータ

source: Run, Step Over/Into/Out, Run to cursor, Stop.
ja: ラン、ステップオーバー/イント/アウト、カーソルまでラン、ストップ。

source: Run, Step Over/Into/Out.
ja: 実行、ステップオーバー、ステップイン、ステップアウト。

source: RunAs - Syntax & Usage | AutoHotkey v2
ja: RunAs - 構文と使用法｜AutoHotkey v2

source: RunWait also supports this parameter, though its OutputVarPID must be checked in another thread (otherwise, the PID will be invalid because the process will have terminated by the time the line following RunWait executes).
ja: RunWaitもこのパラメータをサポートしていますが、そのOutputVarPIDは 別のスレッドでチェックする必要があります（そうしないと、RunWaitに続く行が実行されるまでにプロセスが終了してしまうため、PIDは無効となります）。

source: RunWait returns the exit code.
ja: RunWaitは、終了コードを返します。

source: RunWait will wait until the program finishes before continuing.
ja: RunWaitは、プログラムが終了するまで待ってから続行します。

source: Running Programs & Websites
ja: プログラムとウェブサイトの運営

source: Running a non-UIA script which uses a mouse hook (even as simple as InstallMouseHook) may prevent all mouse hotkeys from working when the mouse is pointing at a window owned by a UIA script, even hotkeys implemented by the UIA script itself.
ja: マウスフックを使用する非UIAスクリプトを実行すると（InstallMouseHookのような単純なものであっても）、マウスがUIAスクリプトが所有するウィンドウを指しているときに、すべてのマウスホットキーが動作しなくなることがあります。

source: Running a v1.1.34.02 or older installer (or a custom install with v1.1.34.03 or newer) will overwrite some of the values set in the registry by the v2 installer, such as the version number, uninstaller entry and parts of the file type registration.
ja: v1.1.34.02以前のインストーラ（またはv1.1.34.03以降のカスタムインストール）を実行すると、バージョン番号、アンインストーラエントリ、ファイルタイプ登録の一部など、v2インストーラによってレジストリに設定された値の一部が上書きされます。

source: Running a v1.1.34.03 or later installer gives this option.
ja: v1.1.34.03以降のインストーラーを実行すると、このオプションが表示されます。

source: Running either "notepad" or "wordpad" on its own works, but for different reasons.
ja: notepad」と「wordpad」のどちらかを単独で実行しても動作しますが、その理由は異なります。

source: Running the Compiler
ja: コンパイラの実行

source: Running the script by pressing a hotkey
ja: ホットキーを押してスクリプトを実行する

source: Runs a program after compilation.
ja: コンパイル後にプログラムを実行する。

source: Runs an external program and waits until it finishes.
ja: 外部プログラムを実行し、終了するまで待ちます。

source: Runs an external program.
ja: 外部プログラムを実行します。

source: Runs the dir command in minimized state and stores the output in a text file.
ja: 最小化状態でdirコマンドを実行し、出力をテキストファイルに保存します。

source: Runtime errors no longer set Exception.What to the currently running user-defined function or sub (but this is still done when calling Error() without the second parameter).
ja: ランタイムエラーで、Exception.Whatを現在実行中のユーザー定義関数またはサブに設定しなくなりました（ただし、Error()を第2パラメータなしで呼び出すと、この設定は行われます）。

source: SE (SendEvent): A delay of length zero is the default.
ja: SE（SendEvent）：長さゼロのディレイがデフォルトです。

source: SE stands for SendEvent.
ja: SEはSendEventの略です。

source: SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.
ja: 本プログラムに欠陥があることが判明した場合、お客様は必要なサービス、修理、修正にかかるすべての費用を負担するものとします。

source: SI (SendInput): Key-delay is ignored because a delay is not possible in this mode.
ja: SI（SendInput）：このモードではディレイができないため、Key-delayは無視されます。

source: SI stands for SendInput, which typically has superior speed and reliability than the other modes.
ja: SIはSendInputの略で、通常、他のモードよりも速度や信頼性に優れています。

source: SM_ARRANGE: Flags specifying how the system arranged minimized windows.
ja: SM_ARRANGE：最小化されたウィンドウをシステムがどのように配置するかを指定するフラグ。

source: SM_CLEANBOOT: Specifies how the system was started:
ja: SM_CLEANBOOT：システムの起動方法を指定する：

source: SM_CMONITORS: Number of display monitors on the desktop (not including "non-display pseudo-monitors").
ja: SM_CMONITORS：デスクトップ上のディスプレイモニターの数（「非ディスプレイ疑似モニター」は含まない）。

source: SM_CMOUSEBUTTONS: Number of buttons on mouse (0 if no mouse is installed).
ja: SM_CMOUSEBUTTONS：マウスのボタン数（マウスがインストールされていない場合は0）。

source: SM_CXBORDER, SM_CYBORDER: Width and height of a window border, in pixels.
ja: SM_CXBORDER、SM_CYBORDER：ウィンドウの境界線の幅と高さをピクセル単位で指定する。

source: SM_CXCURSOR, SM_CYCURSOR: Width and height of a cursor, in pixels.
ja: SM_CXCURSOR、SM_CYCURSOR：カーソルの幅と高さをピクセル単位で示す。

source: SM_CXDOUBLECLK, SM_CYDOUBLECLK: Width and height of the rectangle around the location of a first click in a double-click sequence, in pixels.
ja: SM_CXDOUBLECLK、SM_CYDOUBLECLK：ダブルクリックシーケンスの最初のクリック位置を囲む矩形の幅と高さ（ピクセル単位）。

source: SM_CXDRAG, SM_CYDRAG: Width and height of a rectangle centered on a drag point to allow for limited movement of the mouse pointer before a drag operation begins.
ja: SM_CXDRAG、SM_CYDRAG：ドラッグ操作を開始する前にマウスポインタの移動を制限できるようにするための、ドラッグポイントを中心とした矩形の幅と高さ。

source: SM_CXEDGE, SM_CYEDGE: Dimensions of a 3-D border, in pixels.
ja: SM_CXEDGE、SM_CYEDGE：3次元ボーダーの寸法（ピクセル単位）。

source: SM_CXFIXEDFRAME is the height of the horizontal border and SM_CYFIXEDFRAME is the width of the vertical border.
ja: SM_CXFIXEDFRAMEは水平ボーダーの高さ、SM_CYFIXEDFRAMEは垂直ボーダーの幅。

source: SM_CXFIXEDFRAME, SM_CYFIXEDFRAME (synonymous with SM_CXDLGFRAME, SM_CYDLGFRAME): Thickness of the frame around the perimeter of a window that has a caption but is not sizable, in pixels.
ja: SM_CXFIXEDFRAME、SM_CYFIXEDFRAME（SM_CXDLGFRAME、SM_CYDLGFRAMEと同義）：キャプションを持つが大きくないウィンドウの外周の枠の太さ（ピクセル単位）。

source: SM_CXFOCUSBORDER, SM_CYFOCUSBORDER: Width (in pixels) of the left and right edges and the height of the top and bottom edges of a control's focus rectangle.
ja: SM_CXFOCUSBORDER、SM_CYFOCUSBORDER：コントロールのフォーカス矩形の左右の辺の幅と上下の辺の高さ（ピクセル単位）。

source: SM_CXFULLSCREEN, SM_CYFULLSCREEN: Width and height of the client area for a full-screen window on the primary display monitor, in pixels.
ja: SM_CXFULLSCREEN、SM_CYFULLSCREEN：プライマリディスプレイモニタ上のフルスクリーンウィンドウのクライアント領域の幅と高さをピクセル単位で示す。

source: SM_CXHSCROLL, SM_CYHSCROLL: Width of the arrow bitmap on a horizontal scroll bar, in pixels; and height of a horizontal scroll bar, in pixels.
ja: SM_CXHSCROLL、SM_CYHSCROLL：水平スクロールバーの矢印ビットマップの幅をピクセル単位で、水平スクロールバーの高さをピクセル単位で指定する。

source: SM_CXHTHUMB: Width of the thumb box in a horizontal scroll bar, in pixels.
ja: SM_CXHTHUMB：横スクロールバーのサムボックスの幅をピクセル単位で示す。

source: SM_CXICON, SM_CYICON: Default width and height of an icon, in pixels.
ja: SM_CXICON、SM_CYICON：アイコンのデフォルトの幅と高さをピクセル単位で示す。

source: SM_CXICONSPACING, SM_CYICONSPACING: Dimensions of a grid cell for items in large icon view, in pixels.
ja: SM_CXICONSPACING、SM_CYICONSPACING：大きなアイコン表示のアイテムのグリッドセルの寸法をピクセル単位で指定します。

source: SM_CXMAXIMIZED, SM_CYMAXIMIZED: Default dimensions, in pixels, of a maximized top-level window on the primary display monitor.
ja: SM_CXMAXIMIZED、SM_CYMAXIMIZED：プライマリディスプレイモニタ上で最大化されたトップレベルウィンドウのデフォルト寸法（ピクセル単位）。

source: SM_CXMAXTRACK, SM_CYMAXTRACK: Default maximum dimensions of a window that has a caption and sizing borders, in pixels.
ja: SM_CXMAXTRACK、SM_CYMAXTRACK：キャプションとサイズ調整枠を持つウィンドウのデフォルトの最大寸法、単位はピクセル。

source: SM_CXMENUCHECK, SM_CYMENUCHECK: Dimensions of the default menu check-mark bitmap, in pixels.
ja: SM_CXMENUCHECK、SM_CYMENUCHECK：デフォルトメニューのチェックマークビットマップの寸法をピクセル単位で示す。

source: SM_CXMENUSIZE, SM_CYMENUSIZE: Dimensions of menu bar buttons, such as the child window close button used in the multiple document interface, in pixels.
ja: SM_CXMENUSIZE、SM_CYMENUSIZE：複数ドキュメントのインターフェイスで使われる子ウィンドウを閉じるボタンなどのメニューバーボタンの寸法をピクセル単位で表したもの。

source: SM_CXMIN, SM_CYMIN: Minimum width and height of a window, in pixels.
ja: SM_CXMIN、SM_CYMIN：ウィンドウの最小の幅と高さをピクセル単位で示す。

source: SM_CXMINIMIZED, SM_CYMINIMIZED: Dimensions of a minimized window, in pixels.
ja: SM_CXMINIMIZED、SM_CYMINIMIZED：最小化されたウィンドウの寸法（ピクセル単位）。

source: SM_CXMINSPACING SM_CYMINSPACING: Dimensions of a grid cell for a minimized window, in pixels.
ja: SM_CXMINSPACING、SM_CYMINSPACING：最小化されたウィンドウのグリッドセルの寸法（ピクセル単位）。

source: SM_CXMINSPACING, SM_CYMINSPACING: Dimensions of a grid cell for a minimized window, in pixels.
ja: SM_CXMINSPACING、SM_CYMINSPACING：最小化されたウィンドウのグリッドセルの寸法（ピクセル単位）。

source: SM_CXMINTRACK, SM_CYMINTRACK: Minimum tracking width and height of a window, in pixels.
ja: SM_CXMINTRACK、SM_CYMINTRACK：ウィンドウの最小トラッキング幅と高さをピクセル単位で示す。

source: SM_CXSCREEN, SM_CYSCREEN: Width and height of the screen of the primary display monitor, in pixels.
ja: SM_CXSCREEN、SM_CYSCREEN：プライマリディスプレイモニターの画面の幅と高さをピクセル単位で示す。

source: SM_CXSIZE, SM_CYSIZE: Width and height of a button in a window's caption or title bar, in pixels.
ja: SM_CXSIZE、SM_CYSIZE：ウィンドウのキャプションまたはタイトルバーにあるボタンの幅と高さをピクセル単位で指定する。

source: SM_CXSIZEFRAME is the width of the horizontal border, and SM_CYSIZEFRAME is the height of the vertical border.
ja: SM_CXSIZEFRAMEは水平ボーダーの幅、SM_CYSIZEFRAMEは垂直ボーダーの高さである。

source: SM_CXSIZEFRAME, SM_CYSIZEFRAME: Thickness of the sizing border around the perimeter of a window that can be resized, in pixels.
ja: SM_CXSIZEFRAME、SM_CYSIZEFRAME：リサイズ可能なウィンドウの外周のサイズ調整枠の太さ（ピクセル単位）。

source: SM_CXSMICON, SM_CYSMICON: Recommended dimensions of a small icon, in pixels.
ja: SM_CXSMICON、SM_CYSMICON：小さなアイコンの推奨寸法（ピクセル単位）。

source: SM_CXSMSIZE SM_CYSMSIZE: Dimensions of small caption buttons, in pixels.
ja: SM_CXSMSIZE SM_CYSMSIZE：小さなキャプションボタンの寸法（ピクセル単位）。

source: SM_CXVIRTUALSCREEN, SM_CYVIRTUALSCREEN: Width and height of the virtual screen, in pixels.
ja: SM_CXVIRTUALSCREEN、SM_CYVIRTUALSCREEN：仮想スクリーンの幅と高さ（ピクセル単位）。

source: SM_CXVSCROLL, SM_CYVSCROLL: Width of a vertical scroll bar, in pixels; and height of the arrow bitmap on a vertical scroll bar, in pixels.
ja: SM_CXVSCROLL、SM_CYVSCROLL：縦スクロールバーの幅をピクセル単位で、縦スクロールバーの矢印ビットマップの高さをピクセル単位で指定する。

source: SM_CYCAPTION: Height of a caption area, in pixels.
ja: SM_CYCAPTION：キャプション領域の高さ（ピクセル単位）。

source: SM_CYKANJIWINDOW: For double byte character set versions of the system, this is the height of the Kanji window at the bottom of the screen, in pixels.
ja: SM_CYKANJIWINDOW：ダブルバイト文字セットのバージョンでは、画面下部の漢字ウィンドウの高さをピクセルで表します。

source: SM_CYMENU: Height of a single-line menu bar, in pixels.
ja: SM_CYMENU：単一行メニューバーの高さ（ピクセル単位）。

source: SM_CYSMCAPTION: Height of a small caption, in pixels.
ja: SM_CYSMCAPTION：小さなキャプションの高さ（ピクセル単位）。

source: SM_CYVTHUMB: Height of the thumb box in a vertical scroll bar, in pixels.
ja: SM_CYVTHUMB：縦スクロールバーのサムボックスの高さをピクセル単位で示す。

source: SM_DBCSENABLED: Nonzero if User32.dll supports DBCS; zero otherwise.
ja: SM_DBCSENABLED：User32.dllがDBCSをサポートしている場合は非ゼロ、そうでない場合はゼロ。

source: SM_DEBUG: Nonzero if the debug version of User.exe is installed; zero otherwise.
ja: SM_DEBUG：User.exeのデバッグバージョンがインストールされている場合は0以外、そうでない場合は0。

source: SM_IMMENABLED indicates whether the system is ready to use a Unicode-based IME on a Unicode application.
ja: SM_IMMENABLED は、システムがUnicodeアプリケーションでUnicodeベースのIMEを使用する準備ができているかどうかを示します。

source: SM_IMMENABLED: Nonzero if Input Method Manager/Input Method Editor features are enabled; zero otherwise.
ja: SM_IMMENABLED：入力メソッドマネージャ/入力メソッドエディタ機能が有効な場合は非ゼロ、そうでない場合はゼロ。

source: SM_MENUDROPALIGNMENT: Nonzero if drop-down menus are right-aligned with the corresponding menu-bar item; zero if the menus are left-aligned.
ja: SM_MENUDROPALIGNMENT：ドロップダウンメニューが対応するメニューバーアイテムと右揃えの場合はゼロ以外、左揃えの場合はゼロ。

source: SM_MIDEASTENABLED: Nonzero if the system is enabled for Hebrew and Arabic languages, zero if not.
ja: SM_MIDEASTENABLED：システムがヘブライ語とアラビア語で有効な場合はゼロ以外、有効でない場合はゼロ。

source: SM_MOUSEPRESENT: Nonzero if a mouse is installed; zero otherwise.
ja: SM_MOUSEPRESENT：マウスがインストールされていれば0以外、そうでなければ0。

source: SM_MOUSEWHEELPRESENT: Nonzero if a mouse with a wheel is installed; zero otherwise.
ja: SM_MOUSEWHEELPRESENT：ホイール付きマウスがインストールされていれば0以外、そうでなければ0。

source: SM_NETWORK: Least significant bit is set if a network is present; otherwise, it is cleared.
ja: SM_NETWORK：ネットワークが存在する場合は最下位ビットがセットされ、そうでない場合はクリアされる。

source: SM_PENWINDOWS: Nonzero if the Microsoft Windows for Pen computing extensions are installed; zero otherwise.
ja: SM_PENWINDOWS：Microsoft Windows for Pen コンピューティング拡張がインストールされている場合は非ゼロ、そうでない場合はゼロ。

source: SM_REMOTECONTROL: This system metric is used in a Terminal Services environment.
ja: SM_REMOTECONTROL：このシステム指標はターミナルサービス環境で使用されます。

source: SM_REMOTESESSION: This system metric is used in a Terminal Services environment.
ja: SM_REMOTESESSION：このシステム指標はターミナルサービス環境で使用されます。

source: SM_SAMEDISPLAYFORMAT: Nonzero if all the display monitors have the same color format, zero otherwise.
ja: SM_SAMEDISPLAYFORMAT：すべてのディスプレイモニターのカラーフォーマットが同じであれば0以外、そうでなければ0。

source: SM_SECURE: Nonzero if security is present; zero otherwise.
ja: SM_SECURE：セキュリティがある場合はゼロ以外、ない場合はゼロ。

source: SM_SHOWSOUNDS: Nonzero if the user requires an application to present information visually in situations where it would otherwise present the information only in audible form; zero otherwise.
ja: SM_SHOWSOUNDS：そうでなければ音声のみで情報を提示するような状況で、ユーザがアプリケーションに視覚的な情報提示を要求している場合は0以外、そうでない場合は0。

source: SM_SHUTTINGDOWN: Nonzero if the current session is shutting down; zero otherwise.
ja: SM_SHUTTINGDOWN：現在のセッションがシャットダウンされる場合は非ゼロ、そうでない場合はゼロ。

source: SM_SWAPBUTTON: Nonzero if the meanings of the left and right mouse buttons are swapped; zero otherwise.
ja: SM_SWAPBUTTON：マウスの左ボタンと右ボタンの意味が入れ替わる場合は非ゼロ、そうでない場合はゼロ。

source: SM_XVIRTUALSCREEN, SM_YVIRTUALSCREEN: Coordinates for the left side and the top of the virtual screen.
ja: SM_XVIRTUALSCREEN、SM_YVIRTUALSCREEN：仮想スクリーンの左側と上側の座標。

source: SP (SendPlay): A delay of length zero is the default, which for SendPlay is the same as -1 (no delay).
ja: SP（SendPlay）：長さ0のディレイがデフォルトで、SendPlayの場合は-1（ディレイなし）と同じです。

source: SP stands for SendPlay, which may allow hotstrings to work in a broader variety of games.
ja: SPはSendPlayの略で、より幅広いゲームでホットストリングが使えるようになる可能性があります。
